Tekla.Structures.ModelInternal.dotRebarPluginData_t


Tekla.Structures.ModelInternal.dotRebarPluginData_t.RebarIdentifier


Tekla.Structures.ModelInternal.dotRebarPluginData_t.BarIndex


Tekla.Structures.ModelInternal.dotRebarPluginData_t.IsReversed


Tekla.Structures.ModelInternal.dotRebarPluginData_t.HasStartHook


Tekla.Structures.ModelInternal.dotRebarPluginData_t.HasEndHook


Tekla.Structures.ModelInternal.dotRebarPluginData_t.NumberOfLegs


Tekla.Structures.ModelInternal.dotRebarPluginData_t.NumberOfBendings


Tekla.Structures.ModelInternal.dotRebarPluginData_t.ArcInnerRadius


Tekla.Structures.ModelInternal.dotRebarPluginData_t.ArcOuterRadius


Tekla.Structures.ModelInternal.dotRebarPluginData_t.StartHookLengthA


Tekla.Structures.ModelInternal.dotRebarPluginData_t.EndHookLengthA


Tekla.Structures.ModelInternal.dotRebarPluginData_t.StartHookAngle


Tekla.Structures.ModelInternal.dotRebarPluginData_t.EndHookAngle


Tekla.Structures.ModelInternal.dotRebarPluginData_t.SpiralTotalLength


Tekla.Structures.ModelInternal.dotRebarPluginData_t.ArcLength
